In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')

### 1. How big is the data?

In [3]:
df.shape

(1783, 12)

### 2. How does the data look like?

In [5]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C

In [6]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1781,890.0,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.00,C148,C
1782,891.0,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.75,NaN,Q

In [7]:
df.sample(5) # recommanded

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
233,95.0,0.0,3.0,"Coxon, Mr. Daniel",male,59.0,0.0,0.0,364500,7.2500,NaN,S
1374,483.0,0.0,3.0,"Rouse, Mr. Richard Henry",male,50.0,0.0,0.0,A/5 3594,8.0500,NaN,S
72,73.0,0.0,2.0,"Hood, Mr. Ambrose Jr",male,21.0,0.0,0.0,S.O.C. 14879,73.5000,NaN,S
1207,316.0,1.0,3.0,"Nilsson, Miss. Helmina Josefina",female,26.0,0.0,0.0,347470,7.8542,NaN,S

### 3. what is the data type of columns?

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1783 entries, 0 to 1782
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1782 non-null   float64
 1   Survived     1782 non-null   float64
 2   Pclass       1782 non-null   float64
 3   Name         1782 non-null   object
 4   Sex          1782 non-null   object
 5   Age          1428 non-null   float64
 6   SibSp        1782 non-null   float64
 7   Parch        1782 non-null   float64
 8   Ticket       1782 non-null   object
 9   Fare         1782 non-null   float64
 10  Cabin        408 non-null    object
 11  Embarked     1777 non-null   object
dtypes: float64(7), object(5)
memory usage: 167.3+ KB

### 4. Are there any missing values?

In [9]:
df.isnull().sum()

PassengerId       1
Survived          1
Pclass            1
Name              1
Sex               1
Age             355
SibSp             1
Parch             1
Ticket            1
Fare              1
Cabin          1375
Embarked          6
dtype: int64

### 5. How does the data look mathmatically?

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1782.000000,1782.000000,1782.000000,1428.000000,1782.000000,1782.000000,1782.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.281582,0.486456,0.835836,14.521407,1.102434,0.805831,49.679476
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.250000,0.000000,2.000000,20.000000,0.000000,0.000000,7.903100
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.750000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 6. Are there duplicate values?

In [13]:
df.duplicated().sum()

890

### 7. How is the correlation between cols?

In [14]:
df.corr()

ValueError: could not convert string to float: 'Braund, Mr. Owen Harris'

In [ ]:
df.dropna